tinnfu/CEM5826-M11-MM32L0136C7P/Device/MM32L0130/Include/reg_rtc.h
/**
  * @brief RTC_ALARMASSR Register Bit Definition
  */
#define  RTC_ALARMASSR_SS_Pos                     (0)
#define  RTC_ALARMASSR_SS_Msk                     (0x7FFFU << RTC_ALARMASSR_SS_Pos)                 /*!<Alarm clock subsecond value, used for comparing with the synchronous prescaler counter*/
#define  RTC_ALARMASSR_MASKSS_Pos                 (16)
#define  RTC_ALARMASSR_MASKSS_Msk                 (0x0FU << RTC_ALARMASSR_MASKSS_Pos)               /*!<Max. valid bit when the mask starts from this bit.*/

/**
  * @brief RTC_TAMPCR Register Bit Definition
  */
#define  RTC_TAMPCR_TAMP1E_Pos                    (0)
#define  RTC_TAMPCR_TAMP1E_Msk                    (0x01U << RTC_TAMPCR_TAMP1E_Pos)                  /*!<TAMP1 tamper enable*/
#define  RTC_TAMPCR_TAMP1IE_Pos                   (1)
#define  RTC_TAMPCR_TAMP1IE_Msk                   (0x01U << RTC_TAMPCR_TAMP1IE_Pos)                 /*!<TAMP1 tamper interrupt enable*/
#define  RTC_TAMPCR_TAMP1TRG_Pos                  (2)
#define  RTC_TAMPCR_TAMP1TRG_Msk                  (0x01U << RTC_TAMPCR_TAMP1TRG_Pos)                /*!<TAMP1 tamper valid edge selection*/
#define  RTC_TAMPCR_TAMP1F_Pos                    (3)
#define  RTC_TAMPCR_TAMP1F_Msk                    (0x01U << RTC_TAMPCR_TAMP1F_Pos)                  /*!<TAMP1 tamper flag When the active tamper event is detected on TAMP1 pin, the flag is set by hardware, and cleared by software.*/
#define  RTC_TAMPCR_TAMPTS_Pos                    (4)
#define  RTC_TAMPCR_TAMPTS_Msk                    (0x01U << RTC_TAMPCR_TAMPTS_Pos)                  /*!<Activate timestamp in case of tamper detection event*/
#define  RTC_TAMPCR_TAMP2E_Pos                    (5)
#define  RTC_TAMPCR_TAMP2E_Msk                    (0x01U << RTC_TAMPCR_TAMP2E_Pos)                  /*!<TAMP2 tamper enable*/
#define  RTC_TAMPCR_TAMP2IE_Pos                   (6)
#define  RTC_TAMPCR_TAMP2IE_Msk                   (0x01U << RTC_TAMPCR_TAMP2IE_Pos)                 /*!<TAMP2 tamper interrupt enable*/
#define  RTC_TAMPCR_TAMP2TRG_Pos                  (7)
#define  RTC_TAMPCR_TAMP2TRG_Msk                  (0x01U << RTC_TAMPCR_TAMP2TRG_Pos)                /*!<TAMP2 tamper valid edge selection*/
#define  RTC_TAMPCR_TAMP2F_Pos                    (8)
#define  RTC_TAMPCR_TAMP2F_Msk                    (0x01U << RTC_TAMPCR_TAMP2F_Pos)                  /*!<TAMP2 tamper flagWhen the active tamper event is detected on TAMP2 pin, the flag is set by hardware, and cleared by software.*/
#define  RTC_TAMPCR_TAMP1IF_Pos                   (9)
#define  RTC_TAMPCR_TAMP1IF_Msk                   (0x01U << RTC_TAMPCR_TAMP1IF_Pos)                 /*!<Tamper event 1 interrupt flag. The flag is set by hardware, and cleared by software.*/
#define  RTC_TAMPCR_TAMP2IF_Pos                   (10)
#define  RTC_TAMPCR_TAMP2IF_Msk                   (0x01U << RTC_TAMPCR_TAMP2IF_Pos)                 /*!<Tamper event 2 interrupt flag. The flag is set by hardware, and cleared by software.*/

/**
  * @brief RTC_BKPR Register Bit Definition
  */
#define  RTC_BKPR_BKP_Pos                         (0)
#define  RTC_BKPR_BKP_Msk                         (0xFFFFFFFFU << RTC_BKPR_BKP_Pos)                 /*!<When the device works in the low power mode, the content of these registers keeps active. In case of tamper detection event, the register will be reset. In case of TAMP1F=1 or TAMP2F=1, the register remains reset.*/


#endif

